stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_ll_system.h
/**
  * @brief  Enable Instruction cache
  * @rmtoll FLASH_ACR    FLASH_ACR_ICEN          LL_FLASH_EnableInstCache
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_EnableInstCache(void)
{
  SET_BIT(FLASH->ACR, FLASH_ACR_ICEN);
}

/**
  * @brief  Disable Instruction cache
  * @rmtoll FLASH_ACR    FLASH_ACR_ICEN          LL_FLASH_DisableInstCache
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_DisableInstCache(void)
{
  CLEAR_BIT(FLASH->ACR, FLASH_ACR_ICEN);
}

/**
  * @brief  Enable Instruction cache reset
  * @note  bit can be written only when the instruction cache is disabled
  * @rmtoll FLASH_ACR    FLASH_ACR_ICRST         LL_FLASH_EnableInstCacheReset
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_EnableInstCacheReset(void)
{
  SET_BIT(FLASH->ACR, FLASH_ACR_ICRST);
}

/**
  * @brief  Disable Instruction cache reset
  * @rmtoll FLASH_ACR    FLASH_ACR_ICRST         LL_FLASH_DisableInstCacheReset
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_DisableInstCacheReset(void)
{
  CLEAR_BIT(FLASH->ACR, FLASH_ACR_ICRST);
}

/** Set EMPTY flag information as Flash User area empty
  * @brief
  * @rmtoll FLASH_ACR    FLASH_ACR_EMPTY        LL_FLASH_SetEmptyFlag
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetEmptyFlag(void)
{
  SET_BIT(FLASH->ACR, FLASH_ACR_EMPTY);
}

/** Clear EMPTY flag information as Flash User area programmed
  * @brief
  * @rmtoll FLASH_ACR    FLASH_ACR_EMPTY         LL_FLASH_ClearEmptyFlag
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_ClearEmptyFlag(void)
{
  CLEAR_BIT(FLASH->ACR, FLASH_ACR_EMPTY);
}

/**
   * @brief  Check if the EMPTY flag is set or reset
   * @rmtoll FLASH_ACR    EMPTY      LL_FLASH_IsEmptyFlag
   * @retval State of bit (1 or 0).
   */
__STATIC_INLINE uint32_t LL_FLASH_IsEmptyFlag(void)
{
  return ((READ_BIT(FLASH->ACR, FLASH_ACR_EMPTY) == FLASH_ACR_EMPTY) ? 1UL : 0UL);
}

/** Set EMPTY flag information as Flash User area empty
  * @brief
  * @rmtoll FLASH_ACR    FLASH_ACR_DBG_SWEN        LL_FLASH_EnableDBGAccess
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_EnableDBGAccess(void)
{
  SET_BIT(FLASH->ACR, FLASH_ACR_DBG_SWEN);
}

/** Clear EMPTY flag information as Flash User area programmed
  * @brief
  * @rmtoll FLASH_ACR    FLASH_ACR_DBG_SWEN         LL_FLASH_DisableDBGAccess
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_DisableDBGAccess(void)
{
  CLEAR_BIT(FLASH->ACR, FLASH_ACR_DBG_SWEN);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (FLASH) || defined (SYSCFG) || defined (DBG) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U0xx_LL_SYSTEM_H */
